Revit 2026 API

# NurbsSurfaceData Constructor

---

Copy constructor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public NurbsSurfaceData(
	NurbsSurfaceData other
)
```
```vb
Public Sub New (
	other As NurbsSurfaceData
)
```
```cpp
public:
NurbsSurfaceData(
	NurbsSurfaceData^ other
)
```
```fsharp
new :
        other : NurbsSurfaceData -> NurbsSurfaceData
```

#### Parameters

other NurbsSurfaceData
     The NurbsSurfaceData to copy.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace